class Data {
  static List<Dhkir> morningDhkir = [
    Dhkir(
        name: "رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً",
        period: "صباحًا",
        numberOfRepeat: "3",
        description: "من قالها حين يصبح وحين يمسى كان حقا على الله أن يرضيه يوم القيامة.",
        id: "1"),
    Dhkir(
        name:
            " اللّهُـمَّ إِنِّـي أَصْبَـحْتُ أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلَائِكَتَكَ ، وَجَمـيعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك.",
        period: "صباحًا",
        numberOfRepeat: "1",
        description: "من قالها أعتقه الله من النار",
        id: "1"),
    Dhkir(
        name:
            " اللّهُـمَّ ما أَصْبَـَحَ بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر.",
        period: "صباحًا",
        numberOfRepeat: "1",
        description: "من قالها حين يصبح أدى شكر يومه",
        id: "1"),
    Dhkir(
        name:
            " لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِيرِ.",
        period: "صباحًا",
        numberOfRepeat: "100",
        description: " انت له عدل عشر رقاب، وكتبت له مئة حسنة، ومحيت عنه مئة سيئة، وكانت له حرزا من الشيطان.",
        id: "1"),
    Dhkir(
        name: " سُبْحـانَ اللهِ وَبِحَمْـدِهِ.",
        period: "صباحًا",
        numberOfRepeat: "100",
        description:
            "حُطَّتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ. لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ.",
        id: "1"),
    Dhkir(
        name: "أسْتَغْفِرُ اللهَ وَأتُوبُ إلَيْهِ",
        period: "صباحًا",
        numberOfRepeat: "100",
        description: "مائة حسنة، ومُحيت عنه مائة سيئة، وكانت له حرزاً من الشيطان حتى يمسى.",
        id: "1"),
  ];
  static List<Dhkir> nightDhkir = [
    Dhkir(
        name:
            " اللّهُـمَّ ما أَمسى بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر",
        period: "مساء",
        numberOfRepeat: "1",
        description: "من قالها حين يمسى أدى شكر يومه.",
        id: "2"),
    Dhkir(
        name:
            "بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم.",
        period: "مساء",
        numberOfRepeat: "3",
        description: "لم يضره من الله شيء.",
        id: "2"),
    Dhkir(
        name: " اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد.",
        period: "مساء",
        numberOfRepeat: "10",
        description: "من صلى على حين يصبح وحين يمسى ادركته شفاعتى يوم القيامة.",
        id: "2"),
    Dhkir(
        name:
            " لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِيرِ.",
        period: "مساء",
        numberOfRepeat: "100",
        description: "كانت له عدل عشر رقاب، وكتبت له مئة حسنة، ومحيت عنه مئة سيئة، وكانت له حرزا من الشيطان.",
        id: "2"),
    Dhkir(
        name: " سُبْحـانَ اللهِ وَبِحَمْـدِهِ.",
        period: "مساء",
        numberOfRepeat: "100",
        description:
            "حُطَّتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ. لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ.",
        id: "2"),
    Dhkir(
        name: "أسْتَغْفِرُ اللهَ وَأتُوبُ إلَيْهِ",
        period: "مساء",
        numberOfRepeat: "100",
        description: "مائة حسنة، ومُحيت عنه مائة سيئة، وكانت له حرزاً من الشيطان حتى يمسى.",
        id: "2"),
  ];
  static List<Quran> quranList = [
    Quran(name: " كل من عليها فان ويبقى وجه ربك ذو الجلال والاكرام ", id: "1"),
    Quran(name: "ادعوا ربكم تضرعا وخفية أنه لا يحب المعتدين ", id: "2"),
    Quran(name: " واذكر اسم ربك وتبتل إليه تبتيلا", id: "3"),
    Quran(name: " والله ولي الصابرين", id: "4"),
    Quran(name: " ومن يتق الله يجعل له من أمره يسرا", id: "5"),
    Quran(name: " واتقوا الله لعلكم تفلحون", id: "6"),
  ];

  static List<Quran> duaaList = [
    Quran(name: " كل من عليها فان ويبقى وجه ربك ذو الجلال والاكرام ", id: "1"),
    Quran(name: "ادعوا ربكم تضرعا وخفية أنه لا يحب المعتدين ", id: "2"),
    Quran(name: " واذكر اسم ربك وتبتل إليه تبتيلا", id: "3"),
    Quran(name: " والله ولي الصابرين", id: "4"),
    Quran(name: " ومن يتق الله يجعل له من أمره يسرا", id: "5"),
    Quran(name: " واتقوا الله لعلكم تفلحون", id: "6"),
  ];

  var combineDhkir = morningDhkir + nightDhkir;

  static List<Dhkir> favoriteDhkirList = [];
  static List<Ayah> favoriteAyahList = [];
  static List<Name> NameList = [
    Name(
        name: "الملك",
        description: "هو الله، ملك الملوك، له الملك، وهو مالك يوم الدين، ومليك الخلق فهو المالك المطلق."),
    Name(
        name: "الخافض",
        description:
            "هو الذي يخفض الأذلال لكل من طغى وتجبر وخرج على شريعته وتمرد، وهو الذي يرفع عباده المؤمنين بالطاعات وهو رافع السماوات."),
    Name(
        name: "القابض",
        description:
            "هو الذي يقبض الرزق عمن يشاء من الخلق بعدله، والذي يوسع الرزق لمن يشاء من عباده بجوده ورحمته فهو سبحانه القابض الباسط."),
    Name(
        name: "العدل",
        description:
            "هو الذي حرم الظلم على نفسه، وجعله على عباده محرما، فهو المنزه عن الظلم والجور في أحكامه وأفعاله الذي يعطي كل ذي حق حقه."),
    Name(
        name: "المقيت",
        description: "هو المتكفل بإيصال أقوات الخلق إليهم وهو الحفيظ والمقتدر والقدير والمقدر والممدد."),
    Name(
        name: " الحكيم",
        description:
            "هو المحق في تدبيره اللطيف في تقديره الخبير بحقائق الأمور العليم بحكمه المقدور فجميع خلقه وقضاه خير وحكمة وعدل."),
  ];

  static List<Ayah> ayahList = [
    Ayah(
        name:
            "{وَكَذَلِكَ أَوْحَيْنَا إِلَيْكَ رُوحًا مِّنْ أَمْرِنَا مَا كُنتَ تَدْرِي مَا الْكِتَابُ وَلا الْإِيمَانُ وَلَكِن جَعَلْنَاهُ نُورًا نَّهْدِي بِهِ مَنْ نَّشَاءُ مِنْ عِبَادِنَا وَإِنَّكَ لَتَهْدِي إِلَى صِرَاطٍ مُّسْتَقِيمٍ}",
        description: "القرآن هو النور الذي يهدي الله به من يشاء من عبادى ",
        from: " [الشورى: 52]"),
    Ayah(
      name:
          "{إِنَّا جَعَلْنَاهُ قُرْآنًا عَرَبِيًّا لَّعَلَّكُمْ تَعْقِلُونَ * وَإِنَّهُ فِي أُمِّ الْكِتَابِ لَدَيْنَا لَعَلِيٌّ حَكِيمٌ}",
      description: "منزلة القرآن الكريم العظيمة عند الله سبحانه وتعالى، ومكانته الجليلة ",
      from: " [الزخرف:3-4]",
    ),
    Ayah(
        name:
            "{قُلْ أُوحِيَ إِلَيَّ أَنَّهُ اسْتَمَعَ نَفَرٌ مِّنَ الْجِنِّ فَقَالُوا إِنَّا سَمِعْنَا قُرْآنًا عَجَبًا * يَهْدِي إِلَى الرُّشْدِ فَآمَنَّا بِهِ وَلَن نُّشْرِكَ بِرَبِّنَا أَحَدًا}",
        description: "القرآن هو الكلام الذي يُتعجب من بلاغته وإعجازه، إذ اتّبعه الجن حين سمعوه: ",
        from: "[الجن: 1، 2]"),
    Ayah(
        name:
            "{وَإِذَا مَا أُنزِلَتْ سُورَةٌ فَمِنْهُم مَّن يَقُولُ أَيُّكُمْ زَادَتْهُ هَذِهِ إِيمَانًا فَأَمَّا الَّذِينَ آمَنُوا فَزَادَتْهُمْ إِيمَانًا وَهُمْ يَسْتَبْشِرُونَ * وَأَمَّا الَّذِينَ فِي قُلُوبِهِم مَّرَضٌ فَزَادَتْهُمْ رِجْسًا إِلَى رِجْسِهِمْ وَمَاتُوا وَهُمْ كَافِرُونَ}",
        description: "بشارة للمؤمنين، وزيادة في الإيمان، وللمنافقين وعيد وخسران، ",
        from: " [التوبة: 124، 125]."),
  ];
}

class Dhkir {
  String name;
  String period;
  String numberOfRepeat;
  String description;
  String id;
  Dhkir(
      {required this.name,
      required this.period,
      required this.numberOfRepeat,
      required this.description,
      required this.id});
}

class Quran {
  String name;
  String id;
  Quran({required this.name, required this.id});
}

class Ayah {
  String name;
  String description;
  String from;
  Ayah({required this.name, required this.description, required this.from});
}

class Name {
  String name;
  String description;
  Name({required this.name, required this.description});
}
