class Data {
  static List<Dhkir> morning_dhkir = [
    Dhkir(
        name: "رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً",
        period: "صباحًا",
        numberOfRepeat: "3",
        description: "من قالها حين يصبح وحين يمسى كان حقا على الله أن يرضيه يوم القيامة.",
        id: "1"),
    Dhkir(
        name:
            " اللّهُـمَّ إِنِّـي أَصْبَـحْتُ أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلَائِكَتَكَ ، وَجَمـيعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك.",
        period: "صباحًا",
        numberOfRepeat: "1",
        description: "من قالها أعتقه الله من النار",
        id: "1"),
    Dhkir(
        name:
            " اللّهُـمَّ ما أَصْبَـَحَ بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر.",
        period: "صباحًا",
        numberOfRepeat: "1",
        description: "من قالها حين يصبح أدى شكر يومه",
        id: "1"),
    Dhkir(
        name:
            " لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِيرِ.",
        period: "صباحًا",
        numberOfRepeat: "100",
        description: " انت له عدل عشر رقاب، وكتبت له مئة حسنة، ومحيت عنه مئة سيئة، وكانت له حرزا من الشيطان.",
        id: "1"),
    Dhkir(
        name: " سُبْحـانَ اللهِ وَبِحَمْـدِهِ.",
        period: "صباحًا",
        numberOfRepeat: "100",
        description:
            "حُطَّتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ. لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ.",
        id: "1"),
    Dhkir(
        name: "أسْتَغْفِرُ اللهَ وَأتُوبُ إلَيْهِ",
        period: "صباحًا",
        numberOfRepeat: "100",
        description: "مائة حسنة، ومُحيت عنه مائة سيئة، وكانت له حرزاً من الشيطان حتى يمسى.",
        id: "1"),
  ];
  static List<Dhkir> night_dhkir = [
    Dhkir(
        name:
            " اللّهُـمَّ ما أَمسى بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر",
        period: "مساء",
        numberOfRepeat: "1",
        description: "من قالها حين يمسى أدى شكر يومه.",
        id: "2"),
    Dhkir(
        name:
            "بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم.",
        period: "مساء",
        numberOfRepeat: "3",
        description: "لم يضره من الله شيء.",
        id: "2"),
    Dhkir(
        name: " اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد.",
        period: "مساء",
        numberOfRepeat: "10",
        description: "من صلى على حين يصبح وحين يمسى ادركته شفاعتى يوم القيامة.",
        id: "2"),
    Dhkir(
        name:
            " لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِيرِ.",
        period: "مساء",
        numberOfRepeat: "100",
        description: "كانت له عدل عشر رقاب، وكتبت له مئة حسنة، ومحيت عنه مئة سيئة، وكانت له حرزا من الشيطان.",
        id: "2"),
    Dhkir(
        name: " سُبْحـانَ اللهِ وَبِحَمْـدِهِ.",
        period: "مساء",
        numberOfRepeat: "100",
        description:
            "حُطَّتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ. لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ.",
        id: "2"),
    Dhkir(
        name: "أسْتَغْفِرُ اللهَ وَأتُوبُ إلَيْهِ",
        period: "مساء",
        numberOfRepeat: "100",
        description: "مائة حسنة، ومُحيت عنه مائة سيئة، وكانت له حرزاً من الشيطان حتى يمسى.",
        id: "2"),
  ];

  //List<Dhkir>
  var combine_dhkir = morning_dhkir + night_dhkir;

  static List<Dhkir> favoriteDhkirList = [];
}

class Dhkir {
  String name;
  String period;
  String numberOfRepeat;
  String description;
  String id;
  Dhkir(
      {required this.name,
      required this.period,
      required this.numberOfRepeat,
      required this.description,
      required this.id});
}
